# Concatanate DataFrames

In [2]:
import pandas as pd

In [4]:
india_weather =32,40,35 pd.DataFrame({                            # Data Frame 1
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35],
    "humidity" : [80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78

In [5]:
us_weather = pd.DataFrame({                               # Data Frame 2
    "city" : ["new york","chicago","orlando"],
    "temperature" : [21,14,35],
    "humidity" : [68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Append DataFrame 2 on top of each other (as row)

In [6]:
df = pd.concat([india_weather,us_weather])           # Concatanate = Data Frame 1 + Data Frame 2
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [7]:
df = pd.concat([india_weather,us_weather],ignore_index=True)      # Generating index 0 1 2 3 4 5 instead of 0 1 2 0 1 2
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [8]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           40        60
      2  bangalore           35        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [9]:
df.loc["india"]

        city  temperature  humidity
0     mumbai           32        80
1      delhi           40        60
2  bangalore           35        78

In [10]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Append DataFrame 2 as Column

In [11]:
temperature_df = pd.DataFrame({                            # Data Frame 3
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [12]:
windspeed_df = pd.DataFrame({                            # Data Frame 4
    "city" : ["mumbai","delhi","bangalore"],
    "windspeed" : [7,12,9]
})
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [16]:
df = pd.concat([temperature_df,windspeed_df],axis=1)           # Concatanate = Data Frame 3 + Data Frame 4
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          7
1      delhi           40      delhi         12
2  bangalore           35  bangalore          9

# Index

In [17]:
temperature_df = pd.DataFrame({                            # Data Frame 5
    "city" : ["mumbai","delhi","bangalore"],
    "temperature" : [32,40,35]
},index=[0,1,2])
temperature_df

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [18]:
windspeed_df = pd.DataFrame({                            # Data Frame 6
    "city" : ["delhi","mumbai"],
    "windspeed" : [7,12]
},index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [19]:
df = pd.concat([temperature_df,windspeed_df],axis=1)           # Concatanate = Data Frame 5 + Data Frame 6
df

        city  temperature    city  windspeed
0     mumbai           32  mumbai       12.0
1      delhi           40   delhi        7.0
2  bangalore           35     NaN        NaN

# Series

In [20]:
temperature_df                                              # Data Frame 7

        city  temperature
0     mumbai           32
1      delhi           40
2  bangalore           35

In [21]:
s = pd.Series(["humid","dry","rain"],name="event")           # Data Frame 8
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [22]:
df = pd.concat([temperature_df,s],axis=1)           # Concatanate = Data Frame 7 + Data Frame 8
df

        city  temperature  event
0     mumbai           32  humid
1      delhi           40    dry
2  bangalore           35   rain